use cli_clipboard::{ClipboardContext, ClipboardProvider};

pub fn print_banner() {
    let banner = r#"░██████████░██                      ░██                                                                   ░██    ░██
    ░██    ░██                                                                                            ░██    ░██
    ░██    ░████████   ░███████     ░██░██░████  ░███████  ░████████     ░██    ░██  ░██████   ░██    ░██ ░██ ░████████
    ░██    ░██    ░██ ░██    ░██    ░██░███     ░██    ░██ ░██    ░██    ░██    ░██       ░██  ░██    ░██ ░██    ░██
    ░██    ░██    ░██ ░█████████    ░██░██      ░██    ░██ ░██    ░██     ░██  ░██   ░███████  ░██    ░██ ░██    ░██
    ░██    ░██    ░██ ░██           ░██░██      ░██    ░██ ░██    ░██      ░██░██   ░██   ░██  ░██   ░███ ░██    ░██
    ░██    ░██    ░██  ░███████     ░██░██       ░███████  ░██    ░██       ░███     ░█████░██  ░█████░██ ░██     ░████



               ░████
              ░██
 ░███████  ░████████
░██    ░██    ░██
░██    ░██    ░██
░██    ░██    ░██
 ░███████     ░██



░██
░██
░████████  ░██░████  ░██████    ░██████   ░██    ░██  ░███████   ░███████
░██    ░██ ░███           ░██        ░██  ░██    ░██ ░██    ░██ ░██
░██    ░██ ░██       ░███████   ░███████   ░██  ░██  ░██    ░██  ░███████
░███   ░██ ░██      ░██   ░██  ░██   ░██    ░██░██   ░██    ░██        ░██
░██░█████  ░██       ░█████░██  ░█████░██    ░███     ░███████   ░███████


                                                                                                                        "#;
    println!("{}", banner);
}

pub fn print_welcome() {
    let banner = r#"▖  ▖  ▜            ▗
▌▞▖▌█▌▐ ▛▘▛▌▛▛▌█▌  ▜▘▛▌▖
▛ ▝▌▙▖▐▖▙▖▙▌▌▌▌▙▖  ▐▖▙▌▖
                        "#;

    println!("{}", banner);
}

pub fn clipboard(password: &str) {
    let mut ctx = ClipboardContext::new().unwrap();

    ctx.set_contents(password.to_string()).unwrap();
    println!("[✔]Random Generated Password copied to clipboard! It will be cleared in 25 seconds.");


    std::thread::spawn(move || {
        std::thread::sleep(std::time::Duration::from_secs(25));
        let _ = ctx.set_contents("".to_string());
    });
}